a = int(input("輸入月租費形式為:"))
b = int(input("輸入通話時間為:"))
if a == 186:
    if b*0.09<=186:
        print("通話費為:%.0f" %(b*0.09*0.9))
    else:
        print("通話費為:%.0f" %(b*0.09*0.8))
if a == 386:
    if b*0.08<=386:
        print("通話費為:%.0f" %(b*0.08*0.8))
    else:
        print("通話費為:%.0f" %(b*0.08*0.7))
if a == 586:
    if b*0.07<=586:
        print("通話費為:%.0f" %(b*0.07*0.7))
    else:
        print("通話費為:%.0f" %(b*0.07*0.6))
if a == 986:
    if b*0.06<=986:
        print("通話費為:%.0f" %(b*0.06*0.6))
    else:
        print("通話費為:%.0f" %(b*0.06*0.5))